[
    {
        "model": "blog.post",
        "pk": 1,
        "fields": {
            "title": "Analects (Confucius) - Introduction",
            "created": "2018-07-06",
            "content": "<p>Today, I started reading Analects, by Confucius. My family comes from Korea, where Confucianism has a very strong cultural influence, and I feel that it may be helpful in understanding more about my family&rsquo;s background as well as the influences that have shaped my own life. The edition I am reading can be found <a href=\"http://www.indiana.edu/~p374/Analects_of_Confucius_(Eno-2015).pdf\">here</a>, and is available for free. Thank you, Dr. Robert Eno, for providing this translation.</p>\r\n\r\n<p>...</p>\r\n\r\n<p>Today, I read the introduction to the text, which offered a quick overview of the context in which this book was written. Confucius seems to have lived in the transition period between the Zhou dynasty and the Warring States period, during which the central Zhou power had lost its power to the local lords, who were constantly in conflict. During this time, there was much chaos and lots of social mobility, as traditionally powerful aristocratic families struggled to maintain their place.</p>\r\n\r\n<p>Confucius was a strong proponent of upholding the purity of and preserving Zhou customs. He was conservative, placing great importance in the preservation of hierarchy. Perhaps this stemmed from him attributing the chaos around him to the fact that the traditional hierarchical structures were being threatened. In this way, I thought he was a lot like Thomas Hobbes, who argued for a strong central monarch (a despot) in his book <i>Leviathan</i> in the midst of the English Revolution.</p>\r\n\r\n<p>&#8203;&#8203;Anyway, I&rsquo;m pretty excited to start reading this book, but I&rsquo;m pretty nervous, too. According to the introduction, the order of the passages is highly disorganized and can be hard to follow. I&rsquo;ll can only do my best, I suppose. I&rsquo;ll keep you updated.</p>"
        }
    }

]